# AddInIdAttribute Properties

---
The AddInIdAttribute type exposes the following members.
| Name| Description
---|---|---
| TypeId| When implemented in a derived class, gets a unique identifier for this Attribute.(Inherited from Attribute)
| Value| AddInId guid value.
Top
#### Reference
AddInIdAttribute Class
Autodesk.Revit.DB.Macros Namespace